[
    {
        "user": "hello doctoe",
        "assistant": "```json\n{\n  \"doctors_comment\": \"Hello! It's good to see you. As we've just met for the first time, I'll need some information to understand your current health concerns.  Could you please tell me more about why you're here today?\",\n  \"diagnosis_reached\": \"false\",\n  \"diagnosis\": null,\n  \"prognosis_reached\": \"false\",\n  \"prognosis\": null,\n  \"tests_required\": \"false\",\n  \"tests\": [],\n  \"possible_medications\": [],\n  \"questions\": [\n    \"What brings you in today?\",\n    \"Can you describe your symptoms?\",\n    \"When did these symptoms start?\",\n    \"Have you experienced these symptoms before?\",\n    \"Are you taking any medications or supplements currently?\",\n    \"Do you have any known allergies?\"\n  ]\n}\n```"
    },
    {
        "user": "I've sour throat and cough past 2 days",
        "assistant": "```json\n{\n  \"doctors_comment\": \"I understand you've been experiencing a sore throat and cough for the past two days.  Let's gather some more information to figure out what might be going on.\",\n  \"diagnosis_reached\": \"false\",\n  \"diagnosis\": null,\n  \"prognosis_reached\": \"false\",\n  \"prognosis\": null,\n  \"tests_required\": \"false\",\n  \"tests\": [],\n  \"possible_medications\": [],\n  \"questions\": [\n    \"Can you describe the character of your cough?  Is it dry, wet, or productive?\",\n    \"Do you have any other symptoms, such as fever, runny nose, body aches, or difficulty swallowing?\",\n    \"Is the sore throat constant, or does it worsen with certain activities like swallowing or talking?\",\n    \"Have you been exposed to anyone else who has been sick recently?\",\n    \"Do you have any known medical conditions, such as asthma or allergies?\"\n  ]\n}\n```"
    },
    {
        "user": "it's wet\nnone of these\nit's constant. it's not unbarable although\nyes ig, my girlfriend had it\nno i don't have any such conditions",
        "assistant": "```json\n{\n  \"doctors_comment\": \"Thank you for providing that information. It's helpful to know your cough is wet, your sore throat is constant, and you've been exposed to someone else who was sick.  Since your girlfriend had similar symptoms, it's possible you've contracted the same illness.  It's likely a viral upper respiratory infection, but I need a little more information to be sure.\",\n  \"diagnosis_reached\": \"false\",\n  \"diagnosis\": null,\n  \"prognosis_reached\": \"false\",\n  \"prognosis\": null,\n  \"tests_required\": \"false\",\n  \"tests\": [],\n  \"possible_medications\": [],\n  \"questions\": [\n    \"What color is the mucus you're coughing up?\",\n    \"Do you have any chills or night sweats?\",\n    \"Are you experiencing any shortness of breath or wheezing?\",\n    \"How would you describe your energy levels? Are you feeling unusually tired or fatigued?\",\n    \"On a scale of 1 to 10, with 1 being mild and 10 being severe, how would you rate the severity of your sore throat?\"\n\n  ]\n}\n```"
    },
    {
        "user": "white\nno\nno\nnone of that \n4",
        "assistant": "```json\n{\n  \"doctors_comment\": \"Based on the information you've provided, it sounds like you have a common cold, also known as a viral upper respiratory infection.  This is consistent with your symptoms of a wet cough, constant sore throat, recent exposure to someone with similar symptoms, and the white mucus you're coughing up.  The absence of more serious symptoms like fever, chills, shortness of breath, and severe pain makes a more serious condition less likely.\",\n  \"diagnosis_reached\": \"true\",\n  \"diagnosis\": \"Viral Upper Respiratory Infection (Common Cold)\",\n  \"prognosis_reached\": \"true\",\n  \"prognosis\": \"The common cold typically resolves on its own within 7-10 days.  You should start feeling better soon.  However, if your symptoms worsen or persist beyond two weeks, please schedule a follow-up appointment.\",\n  \"tests_required\": \"false\",\n  \"tests\": [],\n  \"possible_medications\": [],\n  \"questions\": []\n}\n```"
    },
    {
        "user": "i'm afraid I;ve tb",
        "assistant": "```json\n{\n  \"doctors_comment\": \"I understand your concern about having tuberculosis (TB). While your symptoms of a cough and sore throat are consistent with a common cold, as we discussed earlier, they can also be present in other conditions, including TB.  To determine if your concern is warranted, I need to ask you some additional questions.\",\n  \"diagnosis_reached\": \"false\",\n  \"diagnosis\": null,\n  \"prognosis_reached\": \"false\",\n  \"prognosis\": null,\n  \"tests_required\": \"false\",\n  \"tests\": [],\n  \"possible_medications\": [],\n  \"questions\": [\n    \"Have you experienced any unexplained weight loss recently?\",\n    \"Have you had a persistent cough lasting longer than three weeks?\",\n    \"Have you coughed up any blood?\",\n    \"Have you experienced any night sweats?\",\n    \"Have you been in close contact with anyone diagnosed with TB?\",\n    \"Have you travelled to any countries where TB is common?\"\n  ]\n}\n```"
    },
    {
        "user": "no\nno\nno\nno\nno\nI live in india",
        "assistant": "```json\n{\n  \"doctors_comment\": \"Thank you for answering those questions.  Living in India, where TB is more prevalent, does increase the general risk, but given that you've denied the key symptoms associated with TB (prolonged cough, coughing up blood, weight loss, night sweats, and close contact with a TB patient), it makes TB significantly less likely.  Combined with your other symptoms and the fact your girlfriend had a similar illness, the common cold remains the most probable diagnosis. However, to completely rule out TB and offer you peace of mind, I recommend a simple test.\",\n  \"diagnosis_reached\": \"false\",\n  \"diagnosis\": null,\n  \"prognosis_reached\": \"false\",\n  \"prognosis\": null,\n  \"tests_required\": \"true\",\n  \"tests\": [\"Tuberculin Skin Test (TST) or Interferon-Gamma Release Assay (IGRA)\"],\n  \"possible_medications\": [],\n  \"questions\": []\n}\n```"
    }
]