[
    {
        "user": "i had constipation today",
        "assistant": "```json\n{\n  \"doctors_comment\": \"I understand you experienced constipation today.  As we're meeting for the first time, I need a bit more information to understand the situation better and offer appropriate advice.\",\n  \"diagnosis_reached\": \"false\",\n  \"diagnosis\": null,\n  \"prognosis_reached\": \"false\",\n  \"questions\": [\n    \"How often do you usually have bowel movements?\",\n    \"What is the consistency of your stool when you do have a bowel movement (e.g., hard, lumpy, soft)?\",\n    \"Have you noticed any changes in your bowel habits recently?\",\n    \"Are you experiencing any other symptoms, such as abdominal pain, bloating, nausea, or blood in your stool?\",\n    \"What is your typical diet like?  (e.g., fiber intake, fluid intake)\",\n    \"Are you currently taking any medications, supplements, or over-the-counter remedies?\"\n  ]\n}\n```"
    },
    {
        "user": "i have history of fisher",
        "assistant": "```json\n{\n  \"doctors_comment\": \"Thank you for sharing that you have a history of a fistula.  Knowing this is important. To clarify, when you say \\\"fistula,\\\" are you referring to an anal fistula, or a fistula located elsewhere in the body?  Also, to understand your current constipation issue better, can you please tell me about your recent bowel movements?\",\n  \"diagnosis_reached\": \"false\",\n  \"diagnosis\": null,\n  \"prognosis_reached\": \"false\",\n  \"questions\": [\n    \"Can you clarify the location of the fistula (e.g., anal, etc.)?\",\n    \"Is the fistula currently active or healed?\",\n    \"Have you had any treatment for the fistula in the past?\",\n    \"How long has it been since your last bowel movement?\",\n    \"What is the consistency of your stool when you do have a bowel movement (e.g., hard, lumpy, soft)?\",\n    \"Are you experiencing any pain or discomfort associated with your constipation or the fistula?\"\n\n  ]\n}\n```"
    },
    {
        "user": "anal\nit was cured two year back\nyes i had treatment. dr. told me intake more fibre and gave a powder medicine\nthis morning\nhard\nnot much just burs sometimes",
        "assistant": "```json\n{\n  \"doctors_comment\": \"Thank you for providing that information. It's helpful to know the fistula was anal, treated, and healed two years ago.  The fact that your stool is hard and you're experiencing some burning suggests that the constipation may be the primary issue at the moment.  While the previous fistula shouldn't directly cause your current constipation, straining due to hard stools could potentially irritate the previously affected area.\",\n  \"diagnosis_reached\": \"false\",\n  \"diagnosis\": null,\n  \"prognosis_reached\": \"false\",\n  \"questions\": [\n    \"Could you describe the powder medicine you were prescribed for the fistula? (If you remember the name, that would be very helpful)\",\n    \"How much fiber are you currently getting in your diet on a daily basis?\",\n    \"What is your fluid intake like daily (water, other beverages)?\",\n    \"Are you physically active?\",\n    \"Do you feel any pressure or pain in your rectum?\",\n    \"Have you tried any over-the-counter remedies for constipation, such as stool softeners or laxatives?\"\n  ]\n}\n```"
    }
]